In [1]:
from pymongo import MongoClient

In [2]:
client=MongoClient(
    host='localhost',
    port=27017
)

In [3]:
client.list_database_names()

['admin', 'config', 'local', 'test', 'ubion']

In [4]:
db=client["ubion"]
db.test.find()

In [5]:
list(db["test"].find())

[{'_id': ObjectId('62329d84f5399e23a103ba9b'), '1': '1', '2': '2', '3': '3'},
 {'_id': ObjectId('62329da6f5399e23a103ba9c'), '1': '1', '2': '2', '3': '3'},
 {'_id': ObjectId('62329daaf5399e23a103ba9d'), '1': '2'},
 {'_id': ObjectId('62329daaf5399e23a103ba9e'), '3': '4'},
 {'_id': ObjectId('6232b7daf5399e23a103bab0'), '1': '1', '2': '2', '3': '3'},
 {'_id': ObjectId('6232b7dcf5399e23a103bab1'), '1': '2'},
 {'_id': ObjectId('6232b7dcf5399e23a103bab2'), '3': '4'}]

In [6]:
data={
    "1":"1",
    "2":"2",
    "3":"3"
    
}
db.test.insert_one(data)

In [7]:
###data변수만들어서 insert_many를 사용해볼것
data=[{
    "1":"2"},
    {"3":"4"}
]
db.test.insert_many(data)

In [8]:
list(db["test"].find())

[{'_id': ObjectId('62329d84f5399e23a103ba9b'), '1': '1', '2': '2', '3': '3'},
 {'_id': ObjectId('62329da6f5399e23a103ba9c'), '1': '1', '2': '2', '3': '3'},
 {'_id': ObjectId('62329daaf5399e23a103ba9d'), '1': '2'},
 {'_id': ObjectId('62329daaf5399e23a103ba9e'), '3': '4'},
 {'_id': ObjectId('6232b7daf5399e23a103bab0'), '1': '1', '2': '2', '3': '3'},
 {'_id': ObjectId('6232b7dcf5399e23a103bab1'), '1': '2'},
 {'_id': ObjectId('6232b7dcf5399e23a103bab2'), '3': '4'},
 {'_id': ObjectId('6232c3aa6314327120821247'), '1': '1', '2': '2', '3': '3'},
 {'_id': ObjectId('6232c3aa6314327120821248'), '1': '2'},
 {'_id': ObjectId('6232c3aa6314327120821249'), '3': '4'}]

In [58]:
import mod_sql

In [64]:
_db=mod_sql.Database()

OperationalError: (2003, "Can't connect to MySQL server on 'darkpreist.iptime.org' (timed out)")

In [62]:
sql="""
        SELECT * FROM emp
        """
result=_db.executeAll(sql)
pd.DataFrame(result).to_csv("emp.csv")

InterfaceError: (0, '')

In [ ]:
pd.read_csv("emp.csv").to_dict

In [ ]:
db.emp.insert_many(result)

In [ ]:
db.emp.find_one()

{'_id': ObjectId('6232b74c4a2c0581e52c2b58'),
 'EMPNO': '7369',
 'ENAME': 'SMITH',
 'JOB': 'CLERK',
 'MGR': '7902',
 'HIREDATE': '1980-12-17',
 'SAL': '800.00',
 'DEPTNO': '20'}

In [ ]:
list(db.emp.find(
    {"ENAME":"SMITH"}
    
))
#SELECT * FROM emp WHERE ENAME="SMITH"

TypeError: 'dict' object is not callable

In [ ]:
result=db.emp.find()

for list in result:
    print(list)

In [ ]:
#컬럼을 사원번호 이름 부서번호만 출력하고 싶으면
#emp 콜렉션에서 키 값이 EMPNO,ENAME,DEPTNO 만 출력이 되도록 코드 작성
result=db.emp.find({},                     #첫번째 중괄호는 WHERE조건문을 쓸 때 사용하는 공간이라고 생각하면 편함, 
    {"EMPNO":1,                            #두번째 괄호는 COLUMN절 1 =TRUE 즉, key의 값을 사용하는 공간
    "ENAME":1,
    "DEPTNO":1}
    )
for list in result:
    print(list)
# select EMPNO, ENAME, DEPTNO from emp
# find 함수는 적어도  인자값이 두개 필요함 따라서 빈값을 넣어주는 이유는 앞의 값을 넣어줘야 뒤의 값을 넣어줄수 있어서

{'_id': ObjectId('6232b74c4a2c0581e52c2b58'), 'EMPNO': '7369', 'ENAME': 'SMITH', 'DEPTNO': '20'}
{'_id': ObjectId('6232b74c4a2c0581e52c2b59'), 'EMPNO': '7499', 'ENAME': 'ALLEN', 'DEPTNO': '30'}
{'_id': ObjectId('6232b74c4a2c0581e52c2b5a'), 'EMPNO': '7521', 'ENAME': 'WARD', 'DEPTNO': '30'}
{'_id': ObjectId('6232b74c4a2c0581e52c2b5b'), 'EMPNO': '7566', 'ENAME': 'JONES', 'DEPTNO': '20'}
{'_id': ObjectId('6232b74c4a2c0581e52c2b5c'), 'EMPNO': '7654', 'ENAME': 'MARTIN', 'DEPTNO': '30'}
{'_id': ObjectId('6232b74c4a2c0581e52c2b5d'), 'EMPNO': '7698', 'ENAME': 'BLAKE', 'DEPTNO': '30'}
{'_id': ObjectId('6232b74c4a2c0581e52c2b5e'), 'EMPNO': '7782', 'ENAME': 'CLARK', 'DEPTNO': '10'}
{'_id': ObjectId('6232b74c4a2c0581e52c2b5f'), 'EMPNO': '7788', 'ENAME': 'SCOTT', 'DEPTNO': '20'}
{'_id': ObjectId('6232b74c4a2c0581e52c2b60'), 'EMPNO': '7839', 'ENAME': 'KING', 'DEPTNO': '10'}
{'_id': ObjectId('6232b74c4a2c0581e52c2b61'), 'EMPNO': '7844', 'ENAME': 'TURNER', 'DEPTNO': '30'}
{'_id': ObjectId('6232b74c4a2c0581e52c2b62'), 'EMPNO': '7876', 'ENAME': 'ADAMS', 'DEPTNO': '20'}
{'_id': ObjectId('6232b74c4a2c0581e52c2b63'), 'EMPNO': '7900', 'ENAME': 'JAMES', 'DEPTNO': '30'}
{'_id': ObjectId('6232b74c4a2c0581e52c2b64'), 'EMPNO': '7902', 'ENAME': 'FORD', 'DEPTNO': '20'}
{'_id': ObjectId('6232b74c4a2c0581e52c2b65'), 'EMPNO': '7934', 'ENAME': 'MILLER', 'DEPTNO': '10'}

In [14]:
list(db.emp.find().sort("ENAME"))

TypeError: 'dict' object is not callable

In [ ]:
result=db.emp.find().sort("ENAME")

for list in result:
    print(list)
#select * from order by ENAME

{'_id': ObjectId('6232b74c4a2c0581e52c2b62'), 'EMPNO': '7876', 'ENAME': 'ADAMS', 'JOB': 'CLERK', 'MGR': '7788', 'HIREDATE': '1987-07-13', 'SAL': '1100.00', 'DEPTNO': '20'}
{'_id': ObjectId('6232b74c4a2c0581e52c2b59'), 'EMPNO': '7499', 'ENAME': 'ALLEN', 'JOB': 'SALESMAN', 'MGR': '7698', 'HIREDATE': '1981-02-20', 'SAL': '1600.00', 'COMM': '300.00', 'DEPTNO': '30'}
{'_id': ObjectId('6232b74c4a2c0581e52c2b5d'), 'EMPNO': '7698', 'ENAME': 'BLAKE', 'JOB': 'MANAGER', 'MGR': '7839', 'HIREDATE': '1981-05-01', 'SAL': '2850.00', 'DEPTNO': '30'}
{'_id': ObjectId('6232b74c4a2c0581e52c2b5e'), 'EMPNO': '7782', 'ENAME': 'CLARK', 'JOB': 'MANAGER', 'MGR': '7839', 'HIREDATE': '1981-06-09', 'SAL': '2450.00', 'DEPTNO': '10'}
{'_id': ObjectId('6232b74c4a2c0581e52c2b64'), 'EMPNO': '7902', 'ENAME': 'FORD', 'JOB': 'ANALYST', 'MGR': '7566', 'HIREDATE': '1981-12-03', 'SAL': '3000.00', 'DEPTNO': '20'}
{'_id': ObjectId('6232b74c4a2c0581e52c2b63'), 'EMPNO': '7900', 'ENAME': 'JAMES', 'JOB': 'CLERK', 'MGR': '7698', 'HIREDATE': '1981-12-03', 'SAL': '950.00', 'DEPTNO': '30'}
{'_id': ObjectId('6232b74c4a2c0581e52c2b5b'), 'EMPNO': '7566', 'ENAME': 'JONES', 'JOB': 'MANAGER', 'MGR': '7839', 'HIREDATE': '1981-04-02', 'SAL': '2975.00', 'DEPTNO': '20'}
{'_id': ObjectId('6232b74c4a2c0581e52c2b60'), 'EMPNO': '7839', 'ENAME': 'KING', 'JOB': 'PRESIDENT', 'HIREDATE': '1981-11-17', 'SAL': '5000.00', 'DEPTNO': '10'}
{'_id': ObjectId('6232b74c4a2c0581e52c2b5c'), 'EMPNO': '7654', 'ENAME': 'MARTIN', 'JOB': 'SALESMAN', 'MGR': '7698', 'HIREDATE': '1981-09-28', 'SAL': '1250.00', 'COMM': '1400.00', 'DEPTNO': '30'}
{'_id': ObjectId('6232b74c4a2c0581e52c2b65'), 'EMPNO': '7934', 'ENAME': 'MILLER', 'JOB': 'CLERK', 'MGR': '7782', 'HIREDATE': '1982-01-23', 'SAL': '1300.00', 'DEPTNO': '10'}
{'_id': ObjectId('6232b74c4a2c0581e52c2b5f'), 'EMPNO': '7788', 'ENAME': 'SCOTT', 'JOB': 'ANALYST', 'MGR': '7566', 'HIREDATE': '1987-06-28', 'SAL': '3000.00', 'DEPTNO': '20'}
{'_id': ObjectId('6232b74c4a2c0581e52c2b58'), 'EMPNO': '7369', 'ENAME': 'SMITH', 'JOB': 'CLERK', 'MGR': '7902', 'HIREDATE': '1980-12-17', 'SAL': '800.00', 'DEPTNO': '20'}
{'_id': ObjectId('6232b74c4a2c0581e52c2b61'), 'EMPNO': '7844', 'ENAME': 'TURNER', 'JOB': 'SALESMAN', 'MGR': '7698', 'HIREDATE': '1981-09-08', 'SAL': '1500.00', 'COMM': '0.00', 'DEPTNO': '30'}
{'_id': ObjectId('6232b74c4a2c0581e52c2b5a'), 'EMPNO': '7521', 'ENAME': 'WARD', 'JOB': 'SALESMAN', 'MGR': '7698', 'HIREDATE': '1981-02-22', 'SAL': '1250.00', 'COMM': '500.00', 'DEPTNO': '30'}

In [18]:
#급여 >2000 데이터만 출력
result=db.emp.find(
    {
        "SAL" : {
           "$gt":2000                                   #2000보다 큰 이라는 뜻
        }
    }
)

for list in result:
    print(list)

#select * from emp where SAL>2000

{'_id': ObjectId('6232c7014a2c0581e52c2b73'), 'EMPNO': 7566, 'ENAME': 'JONES', 'JOB': 'MANAGER', 'MGR': 7839, 'HIREDATE': '1981-04-02', 'SAL': 2975.0, 'DEPTNO': 20}
{'_id': ObjectId('6232c7014a2c0581e52c2b75'), 'EMPNO': 7698, 'ENAME': 'BLAKE', 'JOB': 'MANAGER', 'MGR': 7839, 'HIREDATE': '1981-05-01', 'SAL': 2850.0, 'DEPTNO': 30}
{'_id': ObjectId('6232c7014a2c0581e52c2b76'), 'EMPNO': 7782, 'ENAME': 'CLARK', 'JOB': 'MANAGER', 'MGR': 7839, 'HIREDATE': '1981-06-09', 'SAL': 2450.0, 'DEPTNO': 10}
{'_id': ObjectId('6232c7014a2c0581e52c2b77'), 'EMPNO': 7788, 'ENAME': 'SCOTT', 'JOB': 'ANALYST', 'MGR': 7566, 'HIREDATE': '1987-06-28', 'SAL': 3000.0, 'DEPTNO': 20}
{'_id': ObjectId('6232c7014a2c0581e52c2b78'), 'EMPNO': 7839, 'ENAME': 'KING', 'JOB': 'PRESIDENT', 'HIREDATE': '1981-11-17', 'SAL': 5000.0, 'DEPTNO': 10}
{'_id': ObjectId('6232c7014a2c0581e52c2b7c'), 'EMPNO': 7902, 'ENAME': 'FORD', 'JOB': 'ANALYST', 'MGR': 7566, 'HIREDATE': '1981-12-03', 'SAL': 3000.0, 'DEPTNO': 20}

In [ ]:
list(db.emp.find(
    {
        "SAL" : {
           "$gt":"2000"                                   #2000보다 큰 이라는 뜻
        }
    }
))

In [19]:
#급여 >=2450 데이터만 출력
result=db.emp.find(
    {
        "SAL" : {
           "$gte":2450                                   #2000보다 크거나 같은 이라는 뜻
        }
    }
)

for list in result:
    print(list)

#select * from emp where SAL>=2450

{'_id': ObjectId('6232c7014a2c0581e52c2b73'), 'EMPNO': 7566, 'ENAME': 'JONES', 'JOB': 'MANAGER', 'MGR': 7839, 'HIREDATE': '1981-04-02', 'SAL': 2975.0, 'DEPTNO': 20}
{'_id': ObjectId('6232c7014a2c0581e52c2b75'), 'EMPNO': 7698, 'ENAME': 'BLAKE', 'JOB': 'MANAGER', 'MGR': 7839, 'HIREDATE': '1981-05-01', 'SAL': 2850.0, 'DEPTNO': 30}
{'_id': ObjectId('6232c7014a2c0581e52c2b76'), 'EMPNO': 7782, 'ENAME': 'CLARK', 'JOB': 'MANAGER', 'MGR': 7839, 'HIREDATE': '1981-06-09', 'SAL': 2450.0, 'DEPTNO': 10}
{'_id': ObjectId('6232c7014a2c0581e52c2b77'), 'EMPNO': 7788, 'ENAME': 'SCOTT', 'JOB': 'ANALYST', 'MGR': 7566, 'HIREDATE': '1987-06-28', 'SAL': 3000.0, 'DEPTNO': 20}
{'_id': ObjectId('6232c7014a2c0581e52c2b78'), 'EMPNO': 7839, 'ENAME': 'KING', 'JOB': 'PRESIDENT', 'HIREDATE': '1981-11-17', 'SAL': 5000.0, 'DEPTNO': 10}
{'_id': ObjectId('6232c7014a2c0581e52c2b7c'), 'EMPNO': 7902, 'ENAME': 'FORD', 'JOB': 'ANALYST', 'MGR': 7566, 'HIREDATE': '1981-12-03', 'SAL': 3000.0, 'DEPTNO': 20}

In [21]:
#급여가 2450보다 작은 데이터만 출력
result=db.emp.find(
    {
        "SAL" : {
           "$lte":2450                                   #2000보다 작은 이라는 뜻
        }
    }
)

for list in result:
    print(list)

#select * from emp where SAL<2450
#lte는 작거나 같은

{'_id': ObjectId('6232c7014a2c0581e52c2b70'), 'EMPNO': 7369, 'ENAME': 'SMITH', 'JOB': 'CLERK', 'MGR': 7902, 'HIREDATE': '1980-12-17', 'SAL': 800.0, 'DEPTNO': 20}
{'_id': ObjectId('6232c7014a2c0581e52c2b71'), 'EMPNO': 7499, 'ENAME': 'ALLEN', 'JOB': 'SALESMAN', 'MGR': 7698, 'HIREDATE': '1981-02-20', 'SAL': 1600.0, 'COMM': '300.00', 'DEPTNO': 30}
{'_id': ObjectId('6232c7014a2c0581e52c2b72'), 'EMPNO': 7521, 'ENAME': 'WARD', 'JOB': 'SALESMAN', 'MGR': 7698, 'HIREDATE': '1981-02-22', 'SAL': 1250.0, 'COMM': '500.00', 'DEPTNO': 30}
{'_id': ObjectId('6232c7014a2c0581e52c2b74'), 'EMPNO': 7654, 'ENAME': 'MARTIN', 'JOB': 'SALESMAN', 'MGR': 7698, 'HIREDATE': '1981-09-28', 'SAL': 1250.0, 'COMM': '1400.00', 'DEPTNO': 30}
{'_id': ObjectId('6232c7014a2c0581e52c2b76'), 'EMPNO': 7782, 'ENAME': 'CLARK', 'JOB': 'MANAGER', 'MGR': 7839, 'HIREDATE': '1981-06-09', 'SAL': 2450.0, 'DEPTNO': 10}
{'_id': ObjectId('6232c7014a2c0581e52c2b79'), 'EMPNO': 7844, 'ENAME': 'TURNER', 'JOB': 'SALESMAN', 'MGR': 7698, 'HIREDATE': '1981-09-08', 'SAL': 1500.0, 'COMM': '0.00', 'DEPTNO': 30}
{'_id': ObjectId('6232c7014a2c0581e52c2b7a'), 'EMPNO': 7876, 'ENAME': 'ADAMS', 'JOB': 'CLERK', 'MGR': 7788, 'HIREDATE': '1987-07-13', 'SAL': 1100.0, 'DEPTNO': 20}
{'_id': ObjectId('6232c7014a2c0581e52c2b7b'), 'EMPNO': 7900, 'ENAME': 'JAMES', 'JOB': 'CLERK', 'MGR': 7698, 'HIREDATE': '1981-12-03', 'SAL': 950.0, 'DEPTNO': 30}
{'_id': ObjectId('6232c7014a2c0581e52c2b7d'), 'EMPNO': 7934, 'ENAME': 'MILLER', 'JOB': 'CLERK', 'MGR': 7782, 'HIREDATE': '1982-01-23', 'SAL': 1300.0, 'DEPTNO': 10}

In [23]:
#select * from emp where ENAME =SMITH OR ENAME= ALLEN
result=db.emp.find(
    {
        "$or":[
            {"ENAME":"SMITH"},
            {"ENAME":"ALLEN"}
            
        ]
    }
)

for list in result:
    print(list)

{'_id': ObjectId('6232b74c4a2c0581e52c2b58'), 'EMPNO': '7369', 'ENAME': 'SMITH', 'JOB': 'CLERK', 'MGR': '7902', 'HIREDATE': '1980-12-17', 'SAL': '800.00', 'DEPTNO': '20'}
{'_id': ObjectId('6232b74c4a2c0581e52c2b59'), 'EMPNO': '7499', 'ENAME': 'ALLEN', 'JOB': 'SALESMAN', 'MGR': '7698', 'HIREDATE': '1981-02-20', 'SAL': '1600.00', 'COMM': '300.00', 'DEPTNO': '30'}
{'_id': ObjectId('6232c7014a2c0581e52c2b70'), 'EMPNO': 7369, 'ENAME': 'SMITH', 'JOB': 'CLERK', 'MGR': 7902, 'HIREDATE': '1980-12-17', 'SAL': 800.0, 'DEPTNO': 20}
{'_id': ObjectId('6232c7014a2c0581e52c2b71'), 'EMPNO': 7499, 'ENAME': 'ALLEN', 'JOB': 'SALESMAN', 'MGR': 7698, 'HIREDATE': '1981-02-20', 'SAL': 1600.0, 'COMM': '300.00', 'DEPTNO': 30}

In [24]:
#select * from emp where ENAME =SMITH AND JOB=CLERK
result=db.emp.find(
    {
        "$and":[
            {"ENAME":"SMITH"},
            {"JOB":"CLERK"}
            
        ]
    }
)

for list in result:
    print(list)

{'_id': ObjectId('6232b74c4a2c0581e52c2b58'), 'EMPNO': '7369', 'ENAME': 'SMITH', 'JOB': 'CLERK', 'MGR': '7902', 'HIREDATE': '1980-12-17', 'SAL': '800.00', 'DEPTNO': '20'}
{'_id': ObjectId('6232c7014a2c0581e52c2b70'), 'EMPNO': 7369, 'ENAME': 'SMITH', 'JOB': 'CLERK', 'MGR': 7902, 'HIREDATE': '1980-12-17', 'SAL': 800.0, 'DEPTNO': 20}

In [25]:
#select * from emp where ENAME =SMITH AND JOB=CLERK
result=db.emp.find(
    {
        "ENAME":"SMITH",
        "JOB":"CLERK"
    }
)

for list in result:
    print(list)
#AND는 기본적으로 잡히므로 OR만 조심

{'_id': ObjectId('6232b74c4a2c0581e52c2b58'), 'EMPNO': '7369', 'ENAME': 'SMITH', 'JOB': 'CLERK', 'MGR': '7902', 'HIREDATE': '1980-12-17', 'SAL': '800.00', 'DEPTNO': '20'}
{'_id': ObjectId('6232c7014a2c0581e52c2b70'), 'EMPNO': 7369, 'ENAME': 'SMITH', 'JOB': 'CLERK', 'MGR': 7902, 'HIREDATE': '1980-12-17', 'SAL': 800.0, 'DEPTNO': 20}

In [39]:
#SELET *FROM emp WHERE SAL>=2000 AND SAL<4000
result = db.emp.find(
    {
        "SAL":{
            "$gte":2000,
            "$lt":4000}
    },{"_id":0}
)
pd.DataFrame(result)
#_id를 없애려면 "_id":0

   EMPNO  ENAME      JOB   MGR    HIREDATE     SAL  DEPTNO
0   7566  JONES  MANAGER  7839  1981-04-02  2975.0      20
1   7698  BLAKE  MANAGER  7839  1981-05-01  2850.0      30
2   7782  CLARK  MANAGER  7839  1981-06-09  2450.0      10
3   7788  SCOTT  ANALYST  7566  1987-06-28  3000.0      20
4   7902   FORD  ANALYST  7566  1981-12-03  3000.0      20

In [43]:
#SELECT * FROM emp where ENAME LIKE %S%
result =db.emp.find(
    {
        "ENAME":{
            "$regex":"S"
        }
    }
    
)
pd.DataFrame(result)

,_id,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,DEPTNO
0,6232b74c4a2c0581e52c2b58,7369,SMITH,CLERK,7902,1980-12-17,800.00,20
1,6232b74c4a2c0581e52c2b5b,7566,JONES,MANAGER,7839,1981-04-02,2975.00,20
2,6232b74c4a2c0581e52c2b5f,7788,SCOTT,ANALYST,7566,1987-06-28,3000.00,20
3,6232b74c4a2c0581e52c2b62,7876,ADAMS,CLERK,7788,1987-07-13,1100.00,20
4,6232b74c4a2c0581e52c2b63,7900,JAMES,CLERK,7698,1981-12-03,950.00,30
5,6232c7014a2c0581e52c2b70,7369,SMITH,CLERK,7902,1980-12-17,800.0,20
6,6232c7014a2c0581e52c2b73,7566,JONES,MANAGER,7839,1981-04-02,2975.0,20
7,6232c7014a2c0581e52c2b77,7788,SCOTT,ANALYST,7566,1987-06-28,3000.0,20
8,6232c7014a2c0581e52c2b7a,7876,ADAMS,CLERK,7788,1987-07-13,1100.0,20
9,6232c7014a2c0581e52c2b7b,7900,JAMES,CLERK,7698,1981-12-03,950.0,30

In [41]:
#SELECT * FROM emp where ENAME LIKE S%
result =db.emp.find(
    {
        "ENAME":{
            "$regex":"^S"
        }
    }
    
)
pd.DataFrame(result)

,_id,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,DEPTNO
0,6232b74c4a2c0581e52c2b58,7369,SMITH,CLERK,7902,1980-12-17,800.00,20
1,6232b74c4a2c0581e52c2b5f,7788,SCOTT,ANALYST,7566,1987-06-28,3000.00,20
2,6232c7014a2c0581e52c2b70,7369,SMITH,CLERK,7902,1980-12-17,800.0,20
3,6232c7014a2c0581e52c2b77,7788,SCOTT,ANALYST,7566,1987-06-28,3000.0,20

In [42]:
#SELECT * FROM emp where ENAME LIKE %S
result =db.emp.find(
    {
        "ENAME":{
            "$regex":"S$"
        }
    }
    
)
pd.DataFrame(result)

,_id,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,DEPTNO
0,6232b74c4a2c0581e52c2b5b,7566,JONES,MANAGER,7839,1981-04-02,2975.00,20
1,6232b74c4a2c0581e52c2b62,7876,ADAMS,CLERK,7788,1987-07-13,1100.00,20
2,6232b74c4a2c0581e52c2b63,7900,JAMES,CLERK,7698,1981-12-03,950.00,30
3,6232c7014a2c0581e52c2b73,7566,JONES,MANAGER,7839,1981-04-02,2975.0,20
4,6232c7014a2c0581e52c2b7a,7876,ADAMS,CLERK,7788,1987-07-13,1100.0,20
5,6232c7014a2c0581e52c2b7b,7900,JAMES,CLERK,7698,1981-12-03,950.0,30

In [55]:
# SELECT ENAME, JOB, SAL, DEPTNO FROM emp 
# WHERE SAL >1250 AND
# SAL <= 3000 AND
# JOB = SALESMAN
# ORDER BY ENAME

result= db.emp.find(
    {
        "SAL":{
            "$gt":1250,
            "$lte":3000
        },
        "JOB":"SALESMAN"
        },
        {
            "ENAME":1,
            "JOB":1,
            "SAL":1,
            "DEPTNO":1,
            "_id":0
        }
    ).sort("ENAME")                          #1은 오름차순 -1은 내림차순

pd.DataFrame(result)

    ENAME       JOB     SAL  DEPTNO
0   ALLEN  SALESMAN  1600.0      30
1  TURNER  SALESMAN  1500.0      30